FluidisedBed-reference/CFD/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

    outlet
    {
        type pressureInletOutletVelocity;
        value uniform ( 0 0 0);
    }

	inlet
    {
       type uniformFixedValue;
	uniformValue table
	(
	(0 (0 0 0))
	(1 (0 0 1))
	(5.0 (0 0 1))
	(100.0 (0 0 1))
	);

    }

   

}




// ************************************************************************* //
