FluidisedBed-reference/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.0006/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9476;
        startFace       261264;
    }
    inlet
    {
        type            patch;
        nFaces          871;
        startFace       270740;
    }
    outlet
    {
        type            wall;
        nFaces          871;
        startFace       271611;
    }
)

// ************************************************************************* //
