FluidisedBed-reference/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object transportProperties;
}

    materialName air;
    transportModel Newtonian;
    NewtonianCoeffs
    {
    }

    rho rho [1 -3 0 0 0 0 0 ] 1.205;
    mu mu [1 -1 -1 0 0 0 0 ] 1.9137E-5;
    nu nu [0 2 -1 0 0 0 0 ] 1.5881327800829875E-5;
    Cp Cp [0 2 -2 -1 0 0 0 ] 1006.0;
    Prt Prt [0 0 0 0 0 0 0 ] 0.85;
    lambda lambda [1 1 -3 -1 0 0 0 ] 0.024;
    pRef pRef [1 -1 -2 0 0 0 0 ] 101325.0;
    TRef TRef [0 0 0 1 0 0 0 ] 300.0;
    beta beta [0 0 0 -1 0 0 0 ] 0.00333;
    Pr Pr [0 0 0 0 0 0 0 ] 0.9;
    Cp0 Cp0 [0 0 0 1 0 0 0 ] 1006.0;
    rhoCp0 1.205;