FluidisedBed-reference/CFD/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}

    numberOfSubdomains 12;
    method simple;
    simpleCoeffs
    {
        n ( 4 3 1);
        delta 0.001;
    }

    hierarchicalCoeffs
    {
        n ( 4 3 1 );
        delta 0.001;
        order xyz;
    }

    metisCoeffs
    {
    }

    manualCoeffs
    {
        dataFile "";
    }

    distributed no;
    roots
    (
    );
